In [2]:
import pandas as pd
import numpy as np
from datetime import datetime
import zipfile
from zipfile import ZipFile
import time
import string

# 2.3.Use Cases on Numpy and Pandas

1.) Write a Python program which accepts a list named : randomList = ['a', 0, 2]. Use exception
handling using try-catch which gives the output as:
Output:
1) If the List element is a alphabet or string, the output will be
The entry is a
Oops! <class 'ValueError'> occured.
Next entry.
2) If the List element is “0”,the output will be
The entry is 0
Oops! <class 'ZeroDivisionError'> occured.
Next entry.
3) If the List element is and integer except 0,then output will be:
The entry is 2
The reciprocal of 2 is 0.5 // reciprocal of an integer

In [3]:
l=['a',0,2]
for i in l:
    try:
        a=1/i
        print("The Entry is ",i)
        print("The reciprocal of %d is %f // reciprocal of an integer" %(i, a))      
    except ZeroDivisionError:
        print("The Entry is ",i)
        print("Oops! <class 'ZeroDivisionError'> occured.")
        print('Next entry.')
        print()
    except:
        print('The entry is ',i)
        print("Oops! <class 'ValueError'> occured.")
        print('Next entry.')
        print()

The entry is  a
Oops! <class 'ValueError'> occured.
Next entry.

The Entry is  0
Oops! <class 'ZeroDivisionError'> occured.
Next entry.

The Entry is  2
The reciprocal of 2 is 0.500000 // reciprocal of an integer

2) Array out of Bound Exception
Write a Python program to give exception “Array Out of Bound” if the user wants to access the
elements beyond the list size (use try and except)

In [4]:
try:
    l[5]
except Exception as e:
    print(e)

list index out of range

3) Write a python module script that contains fib2() method to calculate the Fibonacci series
till 1000 and save it as fibo.py.

In [5]:
##Attached in GitHub

4) Write a python module script that contains ispalindrome() method to calculate the input
string as palindrome string or not and save it as palindrome.py.

In [6]:
##Attached in GitHub

5) Write a program in Python with one class called Cipher. Within the constructor of this
class, ask user for a string and store it. Use a static variable, key to store a randomly
generated integer between 1 and 50 inclusive. Implement two methods, encrypt and
decrypt within this class. Encrypt generates and prints a cipher text using the user-entered
string and the key and ecrypt generates decrypted string from ciphertext. The cipher only
encrypts alpha and numeric (A-Z, a-z, 0-9). All Symbols, such as - , ; %, remain unencrypted.
The cipher text can have special characters. Use generator expression to filter out alpha and
numeric characters of the input string and to generate cipher text. Create an instance of this
class, encrypt and decrypt back the user entered string.

In [7]:
class Cipher:
    def __init__(self,string,key):
        self.string=string
        self.key=key
    def encrypt(self):
        s=' '
        dec_key1={}
        dec_key2={}
        dec_key3={}
        n1=list(range(0,10))
        n2=n1[::-1]
        n3=list(string.ascii_lowercase)
        n4=n3[::-1]
        n5=list(string.ascii_uppercase)
        n6=n5[::-1]
        for i in range(0,10):
            dec_key1[str(n1[i])]=str(n2[i])
        for i in range(0,26):
            dec_key2[n3[i]]=n4[i]
        for i in range(0,26):
            dec_key3[n5[i]]=n6[i]
        gen_obj = (x for x in self.string)
        for i in gen_obj:
            if i in dec_key1:
                s=s+dec_key1[i]
            elif i in dec_key2:
                s=s+dec_key2[i]
            elif i in dec_key3:
                s=s+dec_key3[i]
            else:
                s=s+i
        s=s+str(self.key+8).rjust(3, '0')
        return print("Encrypted code is : ",(s.strip()))
    
    def decrypt(self):
            s=' '
            if int(self.string[-3:].rstrip("0"))==self.key+8:
                print("key is valid")
                dec_key1={}
                dec_key2={}
                dec_key3={}
                n1=list(range(0,10))
                n2=n1[::-1]
                n3=list(string.ascii_lowercase)
                n4=n3[::-1]
                n5=list(string.ascii_uppercase)
                n6=n5[::-1]
                for i in range(0,10):
                    dec_key1[str(n2[i])]=str(n1[i])
                for i in range(0,26):
                    dec_key2[n4[i]]=n3[i]
                for i in range(0,26):
                    dec_key3[n6[i]]=n5[i]
                gen_obj = (x for x in self.string[0:len(self.string)-3])
                for i in gen_obj:
                    if i in dec_key1:
                        s=s+dec_key1[i]
                    elif i in dec_key2:
                        s=s+dec_key2[i]
                    elif i in dec_key3:
                        s=s+dec_key3[i]
                    else:
                        s=s+i
                return print("Decrypted code is : ",(s.strip()))
            else:
                print("key or string is invalid")

In [8]:
a=Cipher("goku55l%%%%@",5)
a.encrypt()

Encrypted code is :  tlpf44o%%%%@013

In [9]:
a=Cipher("tlpf44o%%%%@013",5)
a.decrypt()

key is valid
Decrypted code is :  goku55l%%%%@

In [10]:
a=Cipher("tlpf44o%%%%@013",8)
a.decrypt()

key or string is invalid

6) Get Data from the following link:
http://files.grouplens.org/datasets/movielens/ml-20m.zip

I. Read the dataset using pandas.

In [13]:
ratings=pd.read_csv('ratings.csv')
tags=pd.read_csv('tags.csv')
movies=pd.read_csv('movies.csv')

In [14]:
ratings.head()

   userId  movieId  rating   timestamp
0       1        2     3.5  1112486027
1       1       29     3.5  1112484676
2       1       32     3.5  1112484819
3       1       47     3.5  1112484727
4       1       50     3.5  1112484580

In [15]:
tags.head()

   userId  movieId            tag   timestamp
0      18     4141    Mark Waters  1240597180
1      65      208      dark hero  1368150078
2      65      353      dark hero  1368150079
3      65      521  noir thriller  1368149983
4      65      592      dark hero  1368150078

In [16]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

II. Extract the first row from tags and print its type.

In [17]:
tags.iloc[[0]]

   userId  movieId          tag   timestamp
0      18     4141  Mark Waters  1240597180

In [18]:
print(type(tags.iloc[[0]]))

<class 'pandas.core.frame.DataFrame'>

III. Extract row 0, 11, 2000 from tags DataFrame.

In [19]:
tags.iloc[[0,11,2000]]

      userId  movieId                tag   timestamp
0         18     4141        Mark Waters  1240597180
11        65     1783      noir thriller  1368149983
2000     910    68554  conspiracy theory  1368043943

IV. Print index, columns of the DataFrame.

In [20]:
print(tags.index)
print(tags.columns)

RangeIndex(start=0, stop=465564, step=1)
Index(['userId', 'movieId', 'tag', 'timestamp'], dtype='object')

V. Calculate descriptive statistics for the 'ratings' column of the ratings DataFrame. Verify
using describe().

In [21]:
print("count    ",ratings['rating'].count())
print("mean     ",ratings['rating'].mean())
print("std      ",np.std(ratings['rating']))
print("min      ",ratings['rating'].min())
print("25%      ",ratings.rating.quantile(0.25))
print("50%      ",ratings.rating.quantile(0.5))
print("75%      ",ratings.rating.quantile(0.75))
print("max      ",ratings['rating'].max())

count     20000263
mean      3.5255285642993797
std       1.0519888929763066
min       0.5
25%       3.0
50%       3.5
75%       4.0
max       5.0

In [22]:
ratings['rating'].describe()

count    2.000026e+07
mean     3.525529e+00
std      1.051989e+00
min      5.000000e-01
25%      3.000000e+00
50%      3.500000e+00
75%      4.000000e+00
max      5.000000e+00
Name: rating, dtype: float64

VI. Filter out ratings with rating > 5

In [23]:
ratings[ratings['rating'] >5]

Empty DataFrame
Columns: [userId, movieId, rating, timestamp]
Index: []

VII. Find how many null values, missing values are present. Deal with them. Print out how many
rows have been modified.

In [24]:
print("Null data in tags",tags.isnull().sum().sum())
tags[tags['tag'].isnull()]

Null data in tags 16

        userId  movieId  tag   timestamp
373276  116460      123  NaN  1199450867
373277  116460      346  NaN  1199451946
373281  116460     1184  NaN  1199452261
373288  116460     1785  NaN  1199452006
373289  116460     2194  NaN  1199450677
373291  116460     2691  NaN  1199451002
373299  116460     4103  NaN  1199451920
373301  116460     4473  NaN  1199451040
373303  116460     4616  NaN  1199452441
373319  116460     7624  NaN  1199452266
373325  116460     8898  NaN  1199450757
373332  116460    32460  NaN  1199450901
373334  116460    33826  NaN  1199450703
373339  116460    36537  NaN  1199450736
373340  116460    55805  NaN  1199450941
454615  133634    33826  NaN  1221450908

In [25]:
print("Null rows in ratings",ratings.isnull().sum().sum())

Null rows in ratings 0

In [26]:
print("Null rows in movies",movies.isnull().sum().sum())

Null rows in movies 0

VIII. Filter out movies from the movies DataFrame that are of type 'Animation'.

In [27]:
movies[movies['genres'].str.contains('Animation')].head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
12,13,Balto (1995),Adventure|Animation|Children
47,48,Pocahontas (1995),Animation|Children|Drama|Musical|Romance
236,239,"Goofy Movie, A (1995)",Animation|Children|Comedy|Romance
241,244,Gumby: The Movie (1995),Animation|Children

IX. Find the average rating of movies.

In [28]:
ratings.groupby(['movieId'])['rating'].mean().head()

movieId
1    3.921240
2    3.211977
3    3.151040
4    2.861393
5    3.064592
Name: rating, dtype: float64

X. Perform an inner join of movies and tags based on movieId.

In [29]:
pd.merge(movies, tags, on='movieId', how='inner').head()

,movieId,title,genres,userId,tag,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1644,Watched,1417736680
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,computer animation,1183903155
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,Disney animated feature,1183933307
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,Pixar animation,1183934770
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1741,TÃ©a Leoni does not star in this movie,1245093573

XI. Print out the 5 movies that belong to the Comedy genre and have rating greater than 4.

In [30]:
dff=pd.merge(movies, ratings, on='movieId', how='inner')
dff2=dff[dff['rating'] > 4.0]
list(dff2[dff2['genres'].str.contains('Comedy')]['title'].unique())[0:5]

['Toy Story (1995)',
 'Grumpier Old Men (1995)',
 'Waiting to Exhale (1995)',
 'Father of the Bride Part II (1995)',
 'Sabrina (1995)']

XII. Split 'genres' into multiple columns.

In [31]:
movies1= movies.genres.str.split("|",expand=True)
movies1.rename(columns={0:'gen1',1:'gen2',2:'gen3',3:'gen4',4:'gen5',5:'gen6',6:'gen7',7:'gen8',8:'gen9',9:'gen10'},inplace=True)

In [32]:
movies1.head()
movies=pd.concat([movies, movies1], axis=1)
del movies['genres']
movies.head()

,movieId,title,gen1,gen2,gen3,gen4,gen5,gen6,gen7,gen8,gen9,gen10
0,1,Toy Story (1995),Adventure,Animation,Children,Comedy,Fantasy,None,None,None,None,None
1,2,Jumanji (1995),Adventure,Children,Fantasy,None,None,None,None,None,None,None
2,3,Grumpier Old Men (1995),Comedy,Romance,None,None,None,None,None,None,None,None
3,4,Waiting to Exhale (1995),Comedy,Drama,Romance,None,None,None,None,None,None,None
4,5,Father of the Bride Part II (1995),Comedy,None,None,None,None,None,None,None,None,None

XIII. Extract year from title e.g. (1995).

In [33]:
movies['Title']=movies['title'].apply(lambda x: str(x)[0:len(str(x))-7])
movies['Year']=movies['title'].apply(lambda x: str(x)[len(str(x))-5:len(str(x))-1])
del movies['title']

In [34]:
movies.head()

,movieId,gen1,gen2,gen3,gen4,gen5,gen6,gen7,gen8,gen9,gen10,Title,Year
0,1,Adventure,Animation,Children,Comedy,Fantasy,None,None,None,None,None,Toy Story,1995
1,2,Adventure,Children,Fantasy,None,None,None,None,None,None,None,Jumanji,1995
2,3,Comedy,Romance,None,None,None,None,None,None,None,None,Grumpier Old Men,1995
3,4,Comedy,Drama,Romance,None,None,None,None,None,None,None,Waiting to Exhale,1995
4,5,Comedy,None,None,None,None,None,None,None,None,None,Father of the Bride Part II,1995

XIV. Select rows based on timestamps later than 2015-02-01.

In [35]:
import time
import datetime
s = "01/02/2015"
a=time.mktime(datetime.datetime.strptime(s, "%d/%m/%Y").timetuple())
a

1422729000.0

In [36]:
tags[tags['timestamp']>a].head()

     userId  movieId      tag   timestamp
301     318      260    1970s  1424472169
302     318      260  fantasy  1424472169
303     318      260   sci-fi  1424472169
304     318   115149   Action  1424534310
305     318   115149  Revenge  1424534283

XV. Sort the tags DataFrame based on timestamp.

In [37]:
tags.sort_values('timestamp').head()

        userId  movieId              tag   timestamp
333932  100371     2788     monty python  1135429210
333927  100371     1732    coen brothers  1135429236
333924  100371     1206  stanley kubrick  1135429248
333923  100371     1193   jack nicholson  1135429371
333939  100371     5004    peter sellers  1135429399